Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/types_of_employment/types_of_employment.html.txt.tmx
Source language: en
Languages: ga

source: Who is an employee?
ga: Cad is fostaí ann?

source: While in most cases it will be perfectly clear who is an employee, sometimes it is not quite so clear
ga: Cé go mbeidh sé gléshoiléir an chuid is mó den am cé is fostaí, uaireanta ní bhíonn sé chomh soiléir sin amach is amach

source: For example, a business anxious to avoid employment legislation, tax and social insurance may insist that all people working for the firm are self-employed rather than employees
ga: Mar shampla, gnóthas a bheadh ag iarraidh dlíthe na fostaíochta, na cánacha agus an t-árachas sóisialta a sheachaint, b'fhéidir go n-éileodh sé gur dhaoine féinfhostaithe iad na daoine atá ag obair dó seachas fostaithe

source: In other words, the person you are doing work for insists that you are not his/her employee but instead you are a self-employed person asked to do a particular piece of work
ga: Lena é a rá ar bhealach eile, áitíonn an duine dá bhfuil tú ag obair nach fostaí dá chuid thú ach duine féinfhostaithe ar ar iarradh tasc áirithe a dhéanamh

source: You however, consider yourself to be an employee
ga: Dar leat féin, áfach, is fostaí thú

source: In this case - who is right?
ga: Sa chás seo - cé aige a bhfuil an ceart?

source: Deciding whether you are employed or self-employed has a number of implications for you
ga: Beidh torthaí áirithe ar chinneadh na ceiste seo cé acu duine fostaithe nó féinfhostaithe thú

source: The majority of employment protection legislation applies to employees only and the tax and social insurance system will treat you very differently depending on whether you are employed or self-employed
ga: Ní bhaineann an chuid is mó de reachtaíocht maidir leis an bhfostaíocht ach le fostaithe amháin agus is mór idir an chaoi a gcaithfidh an córas cánach agus árachais shóisialta leat de réir mar atá tú fostaithe nó féinfhostaithe

source: There is no definition of employed or self-employed in employment law
ga: Níl aon sainmhíniú ar 'fostaithe' ná ar 'féinfhostaithe' sna dlíthe fostaíochta

source: The decision on your employment status is reached by looking at what you do, how you do it and the terms and conditions under you were engaged
ga: Cinntear ar do stádas fostaíochta de réir na hoibre a dhéanann tú, mar a dhéanann tú í agus de réir na gcoinníollacha ar dá réir a fostaíodh thú

source: The important point is that you (or the person you do work for) don't make the final decision
ga: Tuigtear nach thusa (ná an duine a bhfuil tú ag obair dó) a dhéanann an cinneadh deiridh

source: Instead, Revenue or the Department of Social Protection or perhaps a court or tribunal will make that decision applying standard tests and based on the real nature of your working relationship
ga: A mhalairt sin, is iad na Coimisinéirí Ioncaim nó an Roinn Coimirce Sóisialaí nó b'fhéidir cúirt nó binse, a dhéanfaidh an cinneadh sin ar bhonn na dtrialacha caighdeánacha agus fhíornádúr an chaidrimh oibre agat

source: Examples of such tests are: whether you control the work, who supplies the materials and whether you get holiday pay
ga: Seo samplaí de na trialacha seo: an tusa a rialaíonn an obair, cé a sholáthraíonn na hábhair agus cé acu a bhfaigheann nó nach bhfaigheann tú pá shaoire

source: So it could be that in law you are considered an employee, even though you have agreed with another person that you will work for him or her as a self-employed person
ga: Mar sin d'fhéadfadh a bheith gur fostaí thú de réir an dlí, fiú amháin má thoiligh tú oibriú do dhuine eile i gcáil duine féinfhostaithe

source: The Code of Practice for Determining Employment or Self-employment Status of Individuals (pdf) contains criteria which can be used to clarify whether a person is employed or self-employed
ga: Tá critéir sa Chód Cleachtais maidir le Stádas Fostaíochta nó Féinfhostaíochta Daoine a Chinntiú (pdf) is féidir a úsáid féachaint an bhfuil duine fostaithe nó féinfhostaithe

source: In most cases, it is clear whether a person is an employee or not
ga: Sa chuid is mó de na cásanna, bíonn sé soiléir cé acu an bhfuiltear fostaithe nó féinfhostaithe

source: However if this is a problem for you, then it is best to get more detailed legal advice or guidance from your local tax office or the Scope Section of the Department of Social Protection - see 'Where to apply' below
ga: Ach más fadhb duit é seo, b'fhearr comhairle dhlíthiúil mhionsonraithe a fháil nó treoir ó d'oifig cánach áitiúil nó ó Rannóg Scóipe na Roinne Coimirce Sóisialaí - féach leat 'Cá háit a ndéanfaidh mé iarratas' thíos

source: Part-time employees are in a similar position to full-time employees when it comes to employment protection legislation, although in some instances a part-time employee will need to work a set minimum number of hours for a set period of time before acquiring rights
ga: Tá fostaithe páirtaimseartha i gcás mar a chéile le fostaithe lánaimseartha chomh fada agus a bhaineann le reachtaíocht chosaint fhostaíochta, cé gur gá uaireanta d'fhostaí páirtaimseartha méid áirithe uaireanta a chloig a bheith oibrithe aige/aici le linn tréimhse áirithe sula mbíonn cearta aige/aici

source: You can read more about the protection of part-time employees in this explanatory booklet (pdf) from Workplace Relations Commmission
ga: Tá tuilleadh le léamh faoi chosaint fostaithe páirtaimseartha sa leabhrán míniúcháin (pdf) seo ón gCoimisiún um Chaidreamh san Áit Oibre

source: Many more people are now employed on a fixed-term basis (or on specific purpose contracts)
ga: Is iomaí duine a fhostaítear ar an mbunús seo anois (nó ar chonradh chun críche áirithe)

source: Employees working on repeated fixed-term contracts are covered under the unfair dismissals legislation, through they need to have at least one year's continuous service before they can bring a claim under the Unfair Dismissals Acts
ga: Tá feidhm le cuid mhór den reachtaíocht chosaint fhostaíochta i gcás na bhfostaithe sin agus níl dliteanas le hiarrachtaí conarthaí téarmaí áirithe a úsáid d'fhonn an reachtaíocht um dífhostú éagórach a sheachaint

source: Under the Protection of Employees (Fixed Term Work) Act 2003, employers cannot continually renew fixed term contracts
ga: Faoin Acht um Chosaint Fostaithe (Obair Téarma Shocraithe) 2003, ní féidir le fostaithe a bheith ag síorathnuachan conarthaí ar théarmaí oibre socraithe

source: Employees can only work on one or more fixed term contracts for a continuous period of four years
ga: Ní féidir le fostaithe oibriú go leanúnach ar feadh ceithre bliana agus conradh nó conarthaí ar théarma(í) socraithe acu

source: After this the employee is considered to have a contract of indefinite duration (for example, a permanent contract)
ga: Tar éis an achair seo glactar leis go bhfuil conradh de théarma éiginnte ag an bhfostaí (mar shampla, conradh buan)

source: Under the Act fixed-term workers cannot be treated less favourably than comparable permanent workers
ga: Faoin Acht ní féidir caitheamh le hoibrí ar théarma oibre socraithe puinn níos measa ná le hoibrí buan

source: You can read more about the Protection of Employees (Fixed Term Work) 2003 Act in this explanatory booklet (pdf) from the Workplace Relations Commission
ga: Féadfaidh tú tuilleadh a léamh faoin Acht um Chosaint Fostaithe (Obair Téarma Shocraithe) 2003 sa leabhrán mínithe (pdf) seo ón gCoimisiún um Chaidreamh san Áit Oibre

source: There is no definition of casual employees in employment law
ga: Níl sainmhíniú ar bith ar 'fhostaithe ócáideacha' i ndlíthe fostaíochta

source: In reality, casual workers are on standby to do work as required without fixed hours or attendance arrangements
ga: Mar atá an scéal dáiríre, bíonn na hoibrithe seo ar fuireachas le hobair a dhéanamh de réir mar a bheidh siad ag teastáil, gan uaireanta socra ná socruithe freastail

source: However, these workers are employees, for employment rights purposes
ga: Mar sin féin, is fostaithe iad, chomh fada is a bhaineann le cearta fostaíochta de

source: Some legislation will apply, for example, the right to receive a pay slip
ga: Beidh feidhm ag cuid den reachtaíocht leo, mar shampla, an ceart duillín pá a fháil

source: In other instances where a set period of employment is required it will be unlikely that a casual employee will have sufficient service to qualify, for example, 2 years' service is required in order to be entitled to statutory redundancy
ga: I gcásanna eile mar a bhfuil tréimhse fostaíochta ar leith ag teastáil, ní móide go mbeidh a dhóthain seirbhíse ag fostaí ar fuireachas lena bheith cáilithe: mar shampla teastaíonn dhá bhliain seirbhíse le bheith i dteideal na hiomarcaíochta reachtúla

source: The law does not allow children (that is, those aged under 16) to be employees apart from in very restricted circumstances, for example, to take part in a film
ga: Ní cheadaítear faoin dlí leanaí (.i. iad siúd atá faoi 16) a bheith ina bhfostaithe ach amháin i gcásanna eisceachtúla, mar shampla, le páirt a ghlacadh i scannán

source: • Children aged over 14 may do light work outside school term
ga: • Tá cead ag leanaí os cionn 14 obair éadrom a dhéanamh taobh amuigh de théarmaí na scoile

source: • Children aged over 15, but under 16, may also do light work and this may be during school term
ga: • Tá cead ag leanaí os cionn 15 ach faoi bhun 16 obair éadrom a dhéanamh freisin agus d'fhéadfadh an obair a bheith á déanamh le linn théarmaí na scoile

source: In any of the above circumstances there are restrictions on the number of hours that may be worked and when the work may be done, with a complete prohibition on work between 8pm and 8am
ga: Maidir leis na cásanna sin thuas, tá srianta maidir le líon na n-uaire is féidir a oibriú agus an t-am ar féidir iad a oibriú. Tá cosc iomlán ar obair idir 8 i.n. agus 8 r.n

source: Young people (those between 16-18 years of age) may become employees but there are restrictions on the maximum hours that can be worked and generally the work cannot be between 10pm and 6am
ga: Tá cead ag ógánaigh (iad siúd idir 16-18 bliain d'aois) bheith ina bhfostaithe ach tá srianta ar an uasmhéid uaire a chloig is féidir a oibriú agus is iondúil nach féidir an obair a dhéanamh idir 10 i.n. agus 6 r.n

source: An employer of a child or young person must:
ga: Ní mór d'fhostóir linbh nó ógánaigh:

source: • Obtain a copy of the person's birth certificate
ga: • Cóip de theastas breithe an té sin a fháil

source: • If a child is being employed, obtain a letter of consent from the child's parent / guardian
ga: • Litir toilithe a fháil ó thuismitheoir / caomhnóir an linbh sa chás go bhfuil leanbh á fhostú

source: • Keep records of the employee's details such as date of birth, and of the hours worked
ga: • Taifid a choinneáil maidir le sonraí an fhostaí mar shampla dáta breithe agus uaire a oibrítear
